package com.mhr.common;

import java.io.UnsupportedEncodingException;
import java.text.ParseException;
import java.text.SimpleDateFormat;
import java.util.Calendar;
import java.util.Date;
import java.util.Random;

public class RandomDataUtils {

    private static String[] telFirst = "134,135,136,137,138,139,150,151,152,157,158,159,130,131,132,155,156,133,153".split(",");
    private static String[] email_suffix = "@gmail.com,@yahoo.com,@msn.com,@hotmail.com,@aol.com,@ask.com,@live.com,@qq.com,@0355.net,@163.com,@163.net,@263.net,@3721.net,@yeah.net,@googlemail.com,@126.com,@sina.com,@sohu.com,@yahoo.com.cn".split(",");
    private static String citys[] = {"北京", "广东", "山东", "江苏", "河南", "上海", "河北", "浙江", "香港", "山西", "陕西", "湖南", "重庆", "福建", "天津", "云南", "四川", "广西", "安徽", "海南", "江西", "湖北", "山西", "辽宁", "内蒙古"};
    public static String base = "abcdefghijklmnopqrstuvwxyz0123456789";
    //250本图书名
    public static String[] b_name = {"红楼梦", "活着", "1984", "百年孤独", "飘", "三体全集:地球往事三部曲", "三国演义（全二册）", "房思琪的初恋乐园", "动物农场", "福尔摩斯探案全集（上中下）", "白夜行", "小王子", "天龙八部", "撒哈拉的故事", "安徒生童话故事集", "沉默的大多数:王小波杂文随笔全编", "冰与火之歌（卷一）:权力的游戏", "哈利·波特", "围城", "人类简史:从动物到上帝", "明朝那些事儿（1-9）:限量版", "平凡的世界（全三部）", "局外人", "杀死一只知更鸟", "霍乱时期的爱情","中国历代政治得失", "笑傲江湖（全四册）", "呐喊", "月亮和六便士", "肖申克的救赎", "基督山伯爵", "东方快车谋杀案", "万历十五年", "新名字的故事:那不勒斯四部曲2", "追风筝的人", "失踪的孩子:那不勒斯四部曲4", "江城", "乡土中国", "刀锋", "嫌疑人X的献身", "城南旧事:纪念普及版", "寻路中国:从乡村到工厂的自驾之旅", "射雕英雄传（全四册）", "白鹿原:20周年精装典藏版", "我与地坛:史铁生代表作", "格林童话全集", "傲慢与偏见", "黄金时代:时代三部曲", "野草", "无人生还","艺术的故事", "历史深处的忧虑:近距离看美国之一", "文学回忆录:1989—1994", "史记（全十册）", "上帝掷骰子吗:量子物理史话", "彷徨", "神雕侠侣", "悲惨世界（上中下）", "卡拉马佐夫兄弟", "树上的男爵", "许三观卖血记", "朝花夕拾", "邓小平时代", "哭泣的骆驼", "诗经", "看见", "灿烂千阳", "浪潮之巅", "台北人", "西游记（全二册）", "永恒的终结:关于时间旅行的终极奥秘和恢宏构想", "悉达多", "人间词话", "窗边的小豆豆", "爱你就像爱生命","我们仨", "故事新编", "罗杰疑案:阿加莎·克里斯蒂侦探作品集02", "一个叫欧维的男人决定去死", "最好的告别:关于衰老与死亡，你必须知道的常识", "鼠疫", "道德经", "巨人的陨落:世纪三部曲", "呼兰河传:1947年版本・原版珍藏", "唐诗三百首", "教父", "海子的诗", "飞鸟集", "这些人，那些事", "人生的枷锁", "你当像鸟飞往你的山", "鹿鼎记（全五册）", "看不见的城市", "斯通纳:ANovel", "梦里花落知多少", "叫魂:1768年中国妖术大恐慌", "王尔德童话", "边城", "冬牧场", "美的历程","金色梦乡", "人生的智慧", "时间简史:插图本", "陆犯焉识", "一个陌生女人的来信", "献给阿尔吉侬的花束", "孽子", "离开的，留下的:那不勒斯四部曲3", "國史大綱（上下）", "十万个为什么", "苏菲的世界", "昨日的世界:一个欧洲人的回忆", "史蒂夫·乔布斯传", "经济学原理（上下）", "万水千山走遍", "爱的艺术", "孩子你慢慢来", "四世同堂", "小径分岔的花园", "我也有一个梦想:近距离看美国之三", "浮生六记", "绿毛水怪", "不能承受的生命之轻:中文全译本百万纪念版", "海的女儿:安徒生童话全集之一", "亮剑","面纱", "受戒:汪曾祺自选集", "情书", "古文观止", "倾城之恋", "故事:材质、结构、风格和银幕剧作的原理", "送你一颗子弹", "我的阿勒泰", "球状闪电", "阿勒泰的角落", "温柔的夜", "霸王别姬", "失明症漫记", "德米安:埃米尔·辛克莱的彷徨少年时", "野火集:二十年纪念版", "目送", "银河系漫游指南", "亲爱的安德烈", "枪炮、病菌与钢铁:人类社会的命运", "我不知道该说什么，关于死亡还是爱情:来自切尔诺贝利的声音", "你好，旧时光（上下）", "麦琪的礼物:欧·亨利短篇小说经典", "罗生门", "激荡三十年:中国企业1978-2008（珍藏图文版）", "棋王","社会心理学:（第8版）", "解忧杂货店", "半生缘", "罪与罚", "尼罗河上的惨案", "渴望生活:梵高传", "万物有灵且美", "天朝的崩溃:鸦片战争再研究", "人间草木", "我的天才女友:那不勒斯四部曲1", "茶馆", "荆棘鸟", "总统是靠不住的:近距离看美国之二", "最好的我们", "倚天屠龙记(共四册)", "全球通史:从史前史到21世纪", "顾城的诗", "草房子", "孙子兵法", "一句顶一万句", "一千零一夜", "海风中失落的血色馈赠", "九州·缥缈录", "雷雨", "上学记","民主的细节:美国当代政治观察随笔", "此生未完成:一个母亲、妻子、女儿的生命日记", "雨季不再来", "水浒传（全二册）", "认识电影:插图第11版", "正见:佛陀的证悟", "一桩事先张扬的凶杀案", "从一到无穷大:科学中的事实和臆测", "理想国", "强风吹拂", "青铜时代:时代三部曲", "额尔古纳河右岸", "庄子", "繁花", "圣经", "牧羊少年奇幻之旅", "银河帝国：基地七部曲:百万册纪念版", "火星救援", "中国哲学简史", "众病之王:癌症传", "象棋的故事", "美丽新世界", "黑客与画家:硅谷创业之父PaulGraham文集", "论语", "你一生的故事:特德·姜科幻小说集","巨流河", "金锁记", "当呼吸化为空气", "恶意", "张爱玲文集", "简爱（英文全本）", "荒原狼", "毛姆短篇小说精选集", "夏洛的网", "设计中的设计", "二手时间", "稻草人手记", "步履不停", "挪威的森林", "世界尽头与冷酷仙境", "狂热分子:群众运动圣经", "香水:一个谋杀犯的故事", "佐贺的超级阿嬷", "社会契约论", "牡丹亭", "金阁寺", "世界的凛冬:世纪三部曲2", "人类的群星闪耀时", "ZOO", "多情剑客无情剑(上、中、下)","影响力", "少年凯歌", "通往奴役之路", "规训与惩罚:监狱的诞生", "安娜·卡列尼娜", "哈姆莱特", "老人与海", "告白", "骆驼祥子", "了不起的盖茨比", "美国宪政历程:影响美国的25个司法大案", "海底两万里", "别闹了，费曼先生:科学顽童的故事", "西方哲学史（上卷）", "2001太空漫游", "一个人的村庄", "如父如子", "不存在的骑士", "社会性动物", "尘埃落定", "欢乐英雄", "长袜子皮皮", "长日将尽", "过于喧嚣的孤独", "长夜难明:推理之王3"};

    public static int getNum(int start, int end) {
        return (int) (Math.random() * (end - start + 1) + start);
    }


    //自动生成名字（中文） len 为中文长度
    public static String getRandomJianName() {
        String ret = "";
        Random r = new Random();
        int len = r.nextInt(2) + 2;
        for (int i = 0; i < len; i++) {
            String str = null;
            int hightPos, lowPos; // 定义高低位
            Random random = new Random();
            hightPos = (176 + Math.abs(random.nextInt(39))); // 获取高位值
            lowPos = (161 + Math.abs(random.nextInt(93))); // 获取低位值
            byte[] b = new byte[2];
            b[0] = (new Integer(hightPos).byteValue());
            b[1] = (new Integer(lowPos).byteValue());
            try {
                str = new String(b, "GBK"); // 转成中文
            } catch (UnsupportedEncodingException ex) {
                ex.printStackTrace();
            }
            ret += str;
        }
        return ret;
    }

    //生成随机用户名，数字和字母组成,
    public static String getStringRandom(int length) {

        String val = "";
        Random random = new Random();

        //参数length，表示生成几位随机数
        for (int i = 0; i < length; i++) {

            String charOrNum = random.nextInt(2) % 2 == 0 ? "char" : "num";
            //输出字母还是数字
            if ("char".equalsIgnoreCase(charOrNum)) {
                //输出是大写字母还是小写字母
                int temp = random.nextInt(2) % 2 == 0 ? 65 : 97;
                val += (char) (random.nextInt(26) + temp);
            } else if ("num".equalsIgnoreCase(charOrNum)) {
                val += String.valueOf(random.nextInt(10));
            }
        }
        return val;
    }

    //生成随机省份
    public static String getRandomProvince() {
        Random r = new Random();
        int randomInt = r.nextInt(10000) % citys.length;
        return citys[randomInt];
    }

    //随机性别
    public static String getRandomSex() {
        Random r = new Random();
        String sex[] = {"男", "女"};
        int randomInt = r.nextInt(2);
        return sex[randomInt];
    }

    //随机邮箱
    public static String getRandomEmail() {
        int lMin = 5, lMax = 16;
        int length = getNum(lMin, lMax);
        StringBuffer sb = new StringBuffer();
        for (int i = 0; i < length; i++) {
            int number = (int) (Math.random() * base.length());
            sb.append(base.charAt(number));
        }
        sb.append(email_suffix[(int) (Math.random() * email_suffix.length)]);
        return sb.toString();
    }

    //随机八位数手机
    public static String getRandomPhone() {
        int index = getNum(0, telFirst.length - 1);
        String first = telFirst[index];
        String second = String.valueOf(getNum(1, 888) + 10000).substring(1);
        String thrid = String.valueOf(getNum(1, 9100) + 10000).substring(1);
        return first + second + thrid;
    }

    //随机生日
    private static String cp(int num) {
        String Num = num + "";
        if (Num.length() == 1) {
            return "0" + Num;
        } else {
            return Num;
        }
    }

    public static String getRandomBirth() {
        Random rndYear = new Random();
        int year = rndYear.nextInt(18) + 2000;
        Random rndMonth = new Random();
        int month = rndMonth.nextInt(12) + 1;
        Random rndDay = new Random();
        int Day = rndDay.nextInt(30) + 1;
        Random rndHour = new Random();
        int hour = rndHour.nextInt(23);
        Random rndMinute = new Random();
        int minute = rndMinute.nextInt(60);
        Random rndSecond = new Random();
        int second = rndSecond.nextInt(60);
        return year + "-" + cp(month) + "-" + cp(Day);
    }

    //随机tag
    public static String getRandomTag(){
            Random r = new Random();
            String[] tag = {"文学", "小说", "外国文学", "文学", "经典", "中国文学", "随笔", "日本文学", "散文", "村上春树", "诗歌", "童话", "名著", "儿童文学", "古典文学", "余华", "王小波", "杂文", "当代文学", "张爱玲", "外国名著", "钱钟书", "鲁迅", "诗词", "茨威格", "米兰·昆德拉", "杜拉斯", "港台", "流行", "漫画", "推理", "绘本", "东野圭吾", "青春", "悬疑", "科幻", "言情", "推理小说", "奇幻", "武侠", "日本漫画", "耽美", "网络小说", "科幻小说", "韩寒", "三毛", "亦舒", "阿加莎·克里斯蒂", "金庸", "安妮宝贝", "穿越", "轻小说", "魔幻", "郭敬明", "青春文学", "几米", "J.K.罗琳", "幾米", "张小娴", "校园", "古龙", "高木直子", "沧月", "余秋雨", "落落", "文化", "历史", "心理学", "哲学", "社会学", "传记", "文化", "艺术", "社会", "政治", "设计", "政治学", "宗教", "建筑", "电影", "数学", "中国历史", "回忆录", "思想", "人物传记", "国学", "艺术史", "人文", "音乐", "绘画", "戏剧", "西方哲学", "近代史", "二战", "军事", "佛教", "考古", "自由主义", "美术", "生活", "爱情", "成长", "生活", "心理", "旅行", "女性", "励志", "摄影", "教育", "职场", "美食", "游记", "灵修", "健康", "情感", "人际关系", "两性", "养生", "手工", "家居", "自助游", "经管", "经济学", "管理", "经济", "商业", "金融", "投资", "营销", "理财", "创业", "股票", "广告", "企业史", "策划", "科技", "科普", "互联网", "科学", "编程", "交互设计", "算法", "用户体验", "科技", "web", "交互", "通信", "UE", "神经网络", "UCD", "程序"};
            int randomInt = r.nextInt(10000) % tag.length;
            if(randomInt != 0 && randomInt!= tag.length){
                return tag[randomInt-1] +","+ tag[randomInt] +","+ tag[randomInt + 1];
            }

            return tag[randomInt] ;
    }

    //随机出版社
    public static String getRandomPublish() {
        Random r = new Random();
        String[] publish = {"中国教育出版传媒集团", "人民教育出版社", "高等教育出版社", "语文出版社", "人民邮电出版社", "电子工业出版社", "海豚出版社", "北京出版社", "北京教育出版社", "北京十月文艺出版社", "北京少年儿童出版社", "北京美术摄影出版社", "文津出版社", "北京电子音像出版社", "昆仑出版社", "朝华出版社", "知识产权出版社", "时事出版社", "原子能出版社", "新时代出版社", "学苑出版社", "西苑出版社", "经济科学出版社", "人民音乐出版社", "气象出版社", "国家行政学院音像出版社", "开明出版社", "中国大地出版社", "军事医学科学出版社", "军事科学出版社", "华乐出版社", "海洋出版社", "清华大学出版社", "天津人民出版社", "百花文艺出版社", "新蕾出版社", "天津科学技术出版社", "天津教育出版社", "天津人民美术出版社", "天津古籍出版社", "天津北洋音像出版社", "天津电子出版社", "天津科技翻译出版公司", "天津社会科学院出版社", "天津杨柳青画社", "天津大学出版社", "南开大学出版社", "河北出版传媒集团", "河北人民出版社", "河北美术出版社", "花山文艺出版社", "河北科学技术出版社", "河北少年儿童出版社", "河北教育出版社", "方圆电子音像出版社", "河北大学出版社", "山西人民出版社", "山西教育出版社", "希望出版社", "北岳文艺出版社", "山西科学技术出版社", "山西经济出版社", "三晋出版社", "书海出版社", "山西春秋电子音像出版社", "内蒙古出版集团", "内蒙古人民出版社", "内蒙古教育出版社", "内蒙古科学技术出版社", "内蒙古少年儿童出版社", "内蒙古文化出版社", "远方出版社", "内蒙古大学出版社", "辽宁出版集团", "辽宁人民出版社", "辽宁美术出版社", "辽宁科学技术出版社", "春风文艺出版社", "辽宁少年儿童出版社", "辽宁教育出版社", "辽海出版社", "辽宁民族出版社", "万卷出版公司", "辽宁电子出版社", "辽宁音像出版社", "沈阳出版发行集团", "沈阳出版社", "沈阳电子出版社", "辽宁画报出版社", "大连出版社", "大连理工大学出版社", "大连海事大学出版社", "东北财经大学出版社", "东北大学出版社", "辽宁大学出版社", "辽宁师范大学出版社", "白山出版社", "吉林出版集团", "吉林人民出版社", "吉林教育出版社", "吉林科学技术出版社", "吉林美术出版社", "北方妇女儿童出版社", "吉林文史出版社", "时代文艺出版社", "吉林摄影出版社", "中华工商联合出版社", "吉林音像出版社", "吉林电子出版社", "长春出版社", "吉林大学出版社", "东北师范大学出版社", "延边人民出版社", "延边教育出版社", "延边大学出版社", "黑龙江人民出版社", "黑龙江教育出版社", "黑龙江美术出版社", "北方文艺出版社", "黑龙江科学技术出版社", "黑龙江朝鲜民族出版社", "哈尔滨出版社", "哈尔滨地图出版社", "哈尔滨工业大学出版社", "哈尔滨工程大学出版社", "东北林业大学出版社", "上海世纪出版集团", "上海人民出版社", "上海文艺出版社", "上海人民美术出版社", "少年儿童出版社", "上海音乐出版社", "上海文化出版社", "上海科学技术出版社", "上海古籍出版社", "上海教育出版社", "上海书画出版社", "上海辞书出版社", "上海译文出版社", "学林出版社", "上海锦绣文章出版社", "上海远东出版社", "上海科技教育出版社", "格致出版社", "上海书店出版社", "复旦大学出版社", "上海交通大学出版社", "华东师范大学出版社", "华东理工大学出版社", "上海财经大学出版社", "第二军医大学出版社", "上海大学出版社", "上海科学技术文献出版社", "上海画报出版社", "百家出版社", "立信会计出版社", "东方出版中心", "凤凰出版传媒集团", "江苏人民出版社", "江苏科学技术出版社", "江苏教育出版社", "江苏少年儿童出版社", "江苏美术出版社", "凤凰出版社", "江苏文艺出版社", "译林出版社", "江苏电子音像出版社", "南京出版传媒集团", "南京出版社", "南京音像出版社", "南京大学出版社", "东南大学出版社", "南京师范大学出版社", "河海大学出版社", "苏州大学出版社", "中国矿业大学出版社", "古吴轩出版社", "浙江出版联合集团", "浙江人民出版社", "浙江人民美术出版社", "浙江科学技术出版社", "浙江文艺出版社", "浙江少年儿童出版社", "浙江教育出版社", "浙江古籍出版社", "浙江摄影出版社", "浙江电子音像出版社", "杭州出版社", "浙江大学出版社", "中国美术学院出版社", "西泠印社", "宁波出版社", "安徽出版集团", "安徽人民出版社", "安徽科学技术出版社", "安徽教育出版社", "安徽文艺出版社", "安徽少年儿童出版社", "安徽美术出版社", "黄山书社", "中国科学技术大学出版社", "安徽大学出版社", "海峡出版发行集团", "福建人民出版社", "福建教育出版社", "福建科学技术出版社", "海峡文艺出版社", "福建少年儿童出版社", "福建美术出版社", "鹭江出版社", "福建电子音像出版社", "海峡书局出版社", "福建省地图出版社", "海风出版社", "厦门大学出版社", "江西出版集团", "江西人民出版社", "江西教育出版社", "江西科学技术出版社", "二十一世纪出版社", "百花洲文艺出版社", "江西美术出版社", "红星电子音像出版社", "中国和平出版社", "江西高校出版社", "山东出版集团", "山东人民出版社", "山东文艺出版社", "山东教育出版社", "山东科学技术出版社", "明天出版社", "齐鲁书社", "山东美术出版社", "山东友谊出版社", "山东画报出版社", "山东电子音像出版社", "济南出版社", "青岛出版集团", "青岛出版社", "山东省地图出版社", "黄河出版社", "泰山出版社", "山东大学出版社", "中国海洋大学出版社", "中国石油大学出版社", "河南人民出版社", "大象出版社", "河南科学技术出版社", "海燕出版社", "中州古籍出版社", "河南美术出版社", "文心出版社", "河南文艺出版社", "中原农民出版社", "河南电子音像出版社", "黄河水利出版社", "郑州大学出版社", "河南大学出版社", "湖北长江出版传媒集团", "湖北人民出版社", "长江文艺出版社", "湖北教育出版社", "湖北科学技术出版社", "湖北美术出版社", "崇文书局", "湖北九通电子音像出版社", "武汉大学出版社", "华中科技大学出版社", "华中师范大学出版社", "中国地质大学出版社", "武汉理工大学出版社", "湖南出版投资控股集团", "湖南教育出版社", "湖南美术出版社", "湖南科学技术出版社", "岳麓书社", "湖南少年儿童出版社", "湖南电子音像出版社", "湖南文艺出版社", "湖南人民出版社", "民主与建设出版社", "湖南地图出版社", "中南大学出版社", "湖南大学出版社", "湖南师范大学出版社", "国防科技大学出版社", "广东省出版集团", "广东人民出版社", "广东教育出版社", "广东科技出版社", "花城出版社", "广东新世纪出版社", "广东经济出版社", "广东海燕电子音像出版社", "岭南美术出版社", "广州出版社", "海天出版社", "广东高等教育出版社", "广东音像教材出版社", "广东旅游出版社", "广东省地图出版社", "南方日报出版社", "羊城晚报出版社", "中山大学出版社", "华南理工大学出版社", "暨南大学出版社", "汕头大学出版社", "广西人民出版社", "漓江出版社", "广西教育出版社", "广西科学技术出版社", "广西美术出版社", "接力出版社", "广西金海湾电子音像出版社", "广西民族出版社", "广西师范大学出版社", "南海出版公司", "南方出版社", "海南出版社", "三环出版社", "重庆出版集团", "重庆出版社", "重庆大学出版社", "西南师范大学出版社", "四川出版集团", "四川人民出版社", "四川教育出版社", "四川少年儿童出版社", "四川科学技术出版社", "四川美术出版社", "四川文艺出版社", "四川辞书出版社", "巴蜀书社", "天地出版社", "成都传媒集团", "成都时代出版社", "四川民族出版社", "成都地图出版社", "四川大学出版社", "电子科技大学出版社", "西南财经大学出版社", "西南交通大学出版社", "贵州出版集团", "贵州人民出版社", "贵州教育出版社", "贵州科技出版社", "贵州民族出版社", "孔学堂书局", "贵州文化音像出版社", "贵州大学出版社", "云南人民出版社", "云南教育出版社", "晨光出版社", "云南科技出版社", "云南美术出版社", "云南民族出版社", "德宏民族出版社", "云南大学出版社", "西藏人民出版社", "西藏藏文古籍出版社", "陕西人民出版社", "陕西人民教育出版社", "未来出版社", "陕西科学技术出版社", "陕西人民美术出版社", "三秦出版社", "太白文艺出版社", "陕西旅游出版社", "西安交通大学出版社", "西北工业大学出版社", "西北大学出版社", "西安电子科技大学出版社", "陕西师范大学出版社", "西安出版社", "读者出版集团", "甘肃教育出版社", "甘肃少年儿童出版社", "甘肃民族出版社", "甘肃科学技术出版社", "敦煌文艺出版社", "甘肃人民出版社", "飞天电子音像出版社", "甘肃文化出版社", "兰州大学出版社", "青海人民出版社", "青海民族出版社", "宁夏人民出版社", "阳光出版社", "宁夏人民教育出版社", "新疆人民出版社", "新疆科学技术出版社", "新疆人民卫生出版社", "新疆音像出版社", "新疆青少年出版社", "新疆文化出版社", "新疆教育出版社", "新疆电子音像出版社", "喀什维吾尔文出版社", "伊犁人民出版社", "新疆生产建设兵团出版社", "新疆大学出版社", "西南交通大学出版社", "北京邮电大学出版社", "西南财经大学出版社", "成都时代出版社", "电子科技大学出版社", "成都地图出版社", "漓江出版社", "接力出版社", "广西师范大学出版社", "广西人民出版社", "广西民族出版社", "广西美术出版社", "广西科学技术出版社", "广西教育出版社", "中南大学出版社", "湖南教育出版社", "湘潭大学出版社", "岳麓书社", "湖南文艺出版社", "湖南师范大学出版社", "湖南少年儿童出版社", "湖南人民出版社", "湖南美术出版社", "湖南科学技术出版社", "湖南地图出版社", "湖南大学出版社", "中国地质大学出版社", "武汉理工大学出版社", "武汉大学出版社", "武汉出版社", "中央编译出版社", "北京出版社出版集团", "中华书局", "黄河出版传媒集团有限公司", "中国林业出版社", "中国农业出版社", "中国水利水电出版社", "电子工业出版社", "湖南科学技术出版社", "化学工业出版社", "机械工业出版社", "江苏科学技术出版社", "科学出版社", "人民交通出版社", "人民军医出版社", "人民卫生出版社", "人民邮电出版社", "上海科学技术出版社", "星球地图出版社", "中国纺织出版社", "中国建筑工业出版社", "中国轻工业出版社", "中国人口出版社", "中国中医药出版社", "科学普及出版社", "山西科学技术出版社", "中南大学出版社", "武汉大学出版社", "人民教育出版社", "高等教育出版社", "广东教育出版社", "江苏教育出版社", "教育科学出版社", "浙江教育出版社", "湖北教育出版社", "北京教育出版社", "山西教育出版社", "国家图书馆出版社", "黄山书社", "岳麓书社", "中华书局", "上海古籍出版社", "三晋出版社", "安徽少年儿童出版社", "二十一世纪出版社", "江苏少年儿童出版社", "接力出版社", "明天出版社", "浙江少年儿童出版社", "希望出版社", "文化艺术出版社", "西泠印社出版社", "长江文艺出版社", "北岳文艺出版社", "百花文艺出版社", "北方文艺出版社", "百花洲文艺出版社", "中国书法出版社", "中国文学出版社", "安徽美术出版社", "安徽文艺出版社", "湖南美术出版社", "吉林美术出版社", "江苏美术出版社", "江西美术出版社", "湖南文艺出版社", "人民文学出版社", "人民音乐出版社", "上海文艺出版社", "上海译文出版社", "上海音乐出版社", "浙江摄影出版社", "天津人民美术出版社", "译林出版社", "作家出版社", "漓江出版社"};
        int randomInt = r.nextInt(10000) % publish.length;
        return publish[randomInt];
    }

    //获得随机相隔几天的日子
    public static String getRandomLenDate(int num){
        SimpleDateFormat sdf = new SimpleDateFormat("yyyy-MM-dd");
        Calendar c = Calendar.getInstance();
        //后面的日子
        Date sDate1 = null;
        //第一开始的日子
        Date sDate2 = null;
        try {
            sDate1 = sdf.parse(getRandomBirth());
            sDate2 = sDate1;
        } catch (ParseException e) {
            e.printStackTrace();
        }
        c.setTime(sDate1);
        c.add(Calendar.DAY_OF_MONTH,num);
        sDate1 = c.getTime();
        return sdf.format(sDate2)+","+sdf.format(sDate1);
    }

    //随机 msg
    public static String getRandomMsg(){
        Random r = new Random();
        String[] header = {"忘火警119 危险时刻真朋友;", "灾起心莫急 湿毛巾捂口鼻;", "场逃生有要领　一蹲、二捂、三匍匐;", "火器使用有四法：一是拔掉销子，二是取下管子，三是压下靶子，四是对准火苗子;", "防设施别乱动 扑救火灾有大用;", "烟头莫小看　随便扔留火患;", "床还抽烟 小心命归天;", "场穿行身要低，逃生选择跑楼梯，切莫着急乘电梯;", "锅起火别慌乱，锅盖盖上火不串;", "人走火灭气关 全家老少平安;", "119火警电话要记牢 报警早损失小;", "保持安全出口畅通 给生命一份保障;", "人人把好防火关 有备无患保平安;", "学一分消防知识 多十分平安保障 ;", "全面动员杜绝火患 珍惜生命远离火灾;", "认真学习消防知识 提高自防自救能力;", "消防常识永不忘 遇到火情不惊慌;", "圈占消火栓，消防法不容;", "防火两大忌，麻痹和大意;", "安全能聚千家财，火灾可焚万户心;", "防盗网上开扇门，发生大火好逃生;", "烧香祭祀不注意，小心火神发脾气;", "冒险是火灾之源，谨慎为安全之本;", "企业规模争上游，消防安全要带头;", "消防有法可依 违法必受处罚;", "履行消防职责，规范安全行为;", "安全自查、隐患自改、责任自负;", "消防法规系生命，自觉遵守是保障;", "隐患险于明火，防患胜于救灾;", "人人防火，户户平安;事事防火，国泰民安;", "失火一场空，预防别放松;", "珍爱生命从防火做起，杜绝火患从自我做起;", "查找隐患堵漏洞，消防安全责任重;", "火灾不留情，预防要先行;", "小烟头莫小看，随便扔留火患;", "安全用火，幸福你我;", "火灾逃生命为先，切莫贪图物和钱;", "用火防火不失火，为国为家也为我;", "煤气泄露别慌张，快关阀门快开窗;", "电器着火不要怕，快把电闸去拉下;", "楼道无杂物，消防无后顾;", "防火减灾心有数，家中莫存爆炸物;", "家用电器看管好，火灾事故能减少;", "消防常识都知晓，家家迎来吉祥鸟;", "吸烟烧香点蜡烛，远离床铺可燃物;", "商场购物四处瞅，注意安全出入口;", "电气起火忌水浇，先断电源最重要;", "创消防安全社区，让火灾远离生活;", "儿童玩火最危险，家长老师要严管;", "消防学习经常搞，火灾损失定减少;", "致富千日苦，火烧当时穷;", "汽车加油要注意，严禁吸烟打手机;", "健全制度把好关，消灭火种少抽烟;", "消防法规系生命，自觉遵守是保障;", "积极扑救火灾是每个公民应尽的义务;", "共筑心中“防火墙”，搭起生命安全网;", "消防设施别乱动，扑救火灾有大用;", "疏忽消防一瞬，毁掉幸福一生;", "公众聚集场所必须经过消防安全检查方可投入使用;", "爱护消防器材，掌握使用方法;", "坚持依法治火，保卫湖北平安;", "发生火灾要互助，老人孩子别不顾;", "任何单位和个人都不得占用防火间距，不得阻塞消防通道;", "狼找离群羊，火找违章人;", "上有老、下有小，发生火灾不得了;", "众人警惕不失火，一人麻痹害大伙;", "万人防火不嫌多，一人麻痹闯大祸;", "一次违章松松手，百起火灾在后头;", "安全是最大的节约，火灾是最大的浪费;", "火灾事故不难防，重在遵制守规章;", "消防与效益结伴而行，火灾与损失同时发生;", "容忍火患等于作茧自毙，谨慎行事才能安然无恙;", "企业效益最重要，防火安全第一条;", "安全管理完善求精，火灾事故实现为零;", "消防安全编织幸福的花环，违章动火酿成悔恨的苦酒;", "遵章是安全的先导，违规是火灾的预兆;", "火灾为家庭导演悲剧，安全为生活谱写欢歌。", "商业步行街、集贸市场、住宅小区的物业管理部门，要保证消防车道畅通、消防设施完好;", "公共消防设施应与其他公共基础设施同步设计、同步建设、同步投入使用;", "新、改、扩建工程外保温材料一律不得使用易燃材料;", "火灾高危单位应当投保火灾公众责任保险;", "社会单位要定期开展消防设施维护保养、消防安全评价;", "消防安全重点单位每年至少对本单位建筑消防设施进行一次全面检测;", "对生产、销售假冒伪劣消防产品，质监部门将依法取消其相关产品市场准入资格，工商部门将依法吊销其营业执照;", "对使用不合格消防产品的，公安消防部门要依法查处，情节严重，构成犯罪的，将依法追究其刑事责任;", "中小学校每年应开展不少于1次疏散逃生演练，居(村)委会和物业服务企业每年至少组织居民开展1次灭火应急演练。", "各级政府主要负责人为消防安全第一责任人，分管负责人为主要责任人，严格落实消防安全领导责任;", "贯彻落实《社会消防安全教育培训规定》，全面推行消防安全管理人员、自动消防设施操作人员、政府专职消防队员、企事业单位专职消防队员国家执业资格制度;", "安全监管、工商、质监、交通运输、铁路、公安等部门要加强危险化学品和烟花爆竹、压力容器的安全监管，依法严厉打击违法违规生产、运输、经营、燃放烟花爆竹的行为;", "火灾隐患投诉举报电话96119;", "单位和成年人都有参加有组织的灭火工作的义务;", "应当做好经常性的用火、用电、用油、用气安全检查。鼓励家庭自备简易灭火器材和自救逃生器具;", "人员密集场所应当在醒目位置设置视频、警示牌或者采用广播等形式对公众提示火灾的危险性;", "阻碍消防监督检查人员依法履行职责，或者对履行职责的消防监督检查人员进行围攻、打骂、侮辱的，由公安机关依照《中华人民共和国治安管理处罚法》的规定处罚;", "单位和个人都有保护消防设施、预防火灾、报告火警的义务;", "单位和个人都有举报和投诉消防安全违法行为的权利;", "单位、个人都应当为火灾报警无偿提供便利，不得阻拦报警。严禁谎报火警;", "消防队、专职消防队扑救火灾、实施应急救援，不收取任何费用;", "机关、团体、企业、事业等单位，应当加强对本单位人员的消防宣传教育;", "、广播、电视等有关新闻媒体，有义务向社会进行有针对性消防宣传教育。", "全宣传标语100条", "全校园逢盛期，莘莘学子迎佳音。", "高自防自救能力，保障自身生命安全。", "创海经和谐秩序，共建海经安全校园。", "明守纪树良风，安全教育我先行。", "生命不分贵贱，讲安全不分你我。", "全意识天天有，校园生活乐悠悠", "则伴我心，安全伴我行", "安校园在我心，安全行动手中行", "好的生活从自身的文明开始，成功的未来从生命的安全起步。", "(教学楼楼道)人济济其拥堵兮，吾将慢性而求稳。", "构建文明新校园，须要安全做先锋。", "树立人生价值，提高安全意识。", "增强安全意识，遵守安全章程，掌握安全技能。", "安全是最大的节约，事故是最大的浪费。", "多一份小心，多一份安心，多一点当心，多一点放心。", "放火之心不可有，防火之心不可无。", "谁小看安全问题，安全就让谁出问题。", "微笑辽阔无界，安全超于一切。", "今日今时我为安全而注意，明日明刻安全为我为牵伴。", "事事安全牢记人心，人人幸福洒满校园。", " 人生起落，安全保障 。", " 和谐校园，共创蓝天，安全之责，尽在你我。", " 谨慎行事随时做，幸福安全伴一生 。", " 健康的生活为我们增添姿彩，安全的意识为我们保驾护航 。", " 呵护自己的生命就是对亲人最大的回报。", " 安全关系着你我他，你我他安全被关心。", " 明天的幸福靠今天，今天的平安靠安全", " 居安思危天天乐，防患未然。", " 立安全意识，走平安之路，创和谐校园，舞海经风采。", " 碧波边：进一步，遗恨一世，退一步，成全一家。", " 读安全课本，掌生命之握。", " 紧绷安全琴弦 奏响生命乐章", " 校园讲安全，伴随你我他。", " 安全工程铸广厦万家，先进技术育优秀人才", " 唱响红歌之魂，奏响安全之曲(鸣响安全之钟)", " 警惕诚可贵，谦让价更高，君为安全故，两者岂敢抛。", " 齐心协力共创防火高墙，携手共进打造平安校园。", " 六月骄阳九月天，已是你我游泳时，岸上不知防患早，水下方愧溺水迟。", " 人人持有一卡通，健康卫生伴我行。", " 火不单行，防患未燃。", " 万众一心共创平安校园，互助友爱同筑和谐海经。", "不为一时的冲动放弃自己的美好未来，安全、和谐、文明校园由你我来创建!", " 出门多看一眼，遇事多想一点，安全放重一点。", " 你爱湖水，湖水也会“溺爱”你。", " 马虎人，一失足成千古恨;遵章者，三思行享百年福。", " 踏入校园，走进平安，建设和谐校园，增强自我防范。", " 大事小事讲安全，时时刻刻顾安全。", " 严是爱，松是害，安全给力，平安天天在。", " 不管是骑神马，还是坐浮云，安全第一。", " 绷紧安全弦，奏响青春歌!", " 深海莫去戏，书海任你游!", " 钥匙随身带，门窗随手关!", " 纸币莫过手，一卡通健康!", " 理想，只有在安全的直行线上才会绽放美丽的花朵。", " 今天我们为校园安全建设栽下一棵小树，未来它将在这里成荫。", " 文明在细节，安全须防患，关爱生命旅程，行万里平安路。", " 安全情系生命，文明创造和谐，建设平安校园，你我共同责任。", "以我安全之心，换我校园和谐。", "减速慢行缓一秒，关照生命到一生。", "消防知道记心头，消防器材会使用，消防安全校园宁", "安全心中常驻，幸福生活永伴。", "与平安作伴，与幸福共存。", " 校园安全共担当，和谐生活同分享。", " 安全伴我行，生活甜如蜜。", " 安全警钟长鸣，你我携手同行。", " 文明礼让，安全共创", " 礼让放在先，安全大于天", " 路旁风景学校给，路上安全大家给。", " 安全召唤 声声入耳 生命保障 事事关心", " 红灯停 绿灯行危险停 安全行", " 我们可以拥抱大海 但却不可被海“拥抱”", "安全驻心中 命运握手中", "生命是一种信任 安全是一种责任", "生而有命 安全为重 隐患重重 你我慎行", "前后左右看一看 幸福安全常相伴", "安全之水长流 幸福之树长青", "安全拥护生命的继续 健康赐予生活的精彩", "安全手中握 生命飞不走", "你行我行 安全先行 千好万好 平安才好", "常诵安全经 永贴平安符", "出行谨慎一分 安全伴随一生", "江河湖海几分深 切莫下水自己测", "违规电器用不得 危险隐于不察处", "出行避让一小步 远离危险一大步", "校园文明礼先行，校园安全你先行。", "安全与幸福携手，快乐与健康共存。", "安全意识就像安全带，系好它才能保护自己。", "倡导文明出行，牢记安全准则。", "安全文明和谐，积极奋发博学。", "安全记心间，文明印脑中。", "文明交通我先行，交通事故绕我行", "让不慌张，谦虚谨慎交通畅", "文明交通记心中，法规一刻不放松", "维护校园治安秩序，保障师生人身、财产安全。", " 安全是一种责任，文明是一种礼让", "行，始于足下，交通安全，从我做起.", " 红绿灯就是天使的脸，不理天使，天堂相见。", "三秒顿足观察，一生幸福平安", "一步一行用心看，安全出行靠大家。", "眼观六路，耳听八方，续美好人生。", "安全警句千条万条，安全注意第一条。", ": 谨慎一小步，方行千里万里路。",};
        int randomInt = r.nextInt(10000) % header.length;
        return header[randomInt]+"headerend"+header[randomInt]+"--"+header[randomInt]+"--"+header[randomInt];
    }

    //固定年月随机日期
    public static String getRandomDateDay() {
        Random rndDay = new Random();
        int Day = rndDay.nextInt(30) + 1;
        Random rndHour = new Random();
        return 2021 + "-" + "1" + "-" + cp(Day);
    }

    //随机书名
    public static String getRandomBName(){
        Random r = new Random();
        int randomInt = r.nextInt(10000) % b_name.length;
        return b_name[randomInt];
    }


}


